Reports/ВозвратИзЧастичногоПодряда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ВозвратИзЧастичногоПодряда</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ЧастичныйПодряд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЧастичныйПодряд</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ВозвратИзЧастичногоПодряда/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьТаблицуДанных();

КонецПроцедуры  

Процедура ЗаполнитьТаблицуДанных()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧастичныйПодрядСрезПоследних.ИзделиеКомплект КАК ИзделиеКомплект,
		|	ЧастичныйПодрядСрезПоследних.Подрядчик КАК Подрядчик,
		|	ЧастичныйПодрядСрезПоследних.Комментарий КАК Комментарий,
		|	ЧастичныйПодрядСрезПоследних.НомерЧасти КАК НомерЧасти
		|ИЗ
		|	РегистрСведений.ЧастичныйПодряд.СрезПоследних КАК ЧастичныйПодрядСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Подрядчик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЧастичныйПодрядСрезПоследних.Подрядчик = &Подрядчик
		|		КОНЕЦ
		|	И НЕ ЧастичныйПодрядСрезПоследних.Завершен
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЧастичныйПодрядСрезПоследних.Подрядчик.Наименование,
		|	ЧастичныйПодрядСрезПоследних.ИзделиеКомплект.Наименование";
	
	Запрос.УстановитьПараметр("Подрядчик", Подрядчик);
	
	ТаблицаДанных.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДанныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДанныхПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДанныхПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина; 
	
	ТД = Элементы.ТаблицаДанных.ТекущиеДанные; 
	
	Если ТД = Неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаДанныхИзделияКомплект" Тогда
		ПоказатьЗначение(, ТД.ИзделиеКомплект);
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТаблицаДанныхВозврат" Тогда
		ТД.Возврат = НЕ ТД.Возврат;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТаблицаДанныхПодрядчик" Тогда
		ПоказатьЗначение(, ТД.Подрядчик);
	КонецЕсли;
	
КонецПроцедуры    


&НаКлиенте
Процедура ПодрядчикПриИзменении(Элемент)
	ЗаполнитьТаблицуДанных();
КонецПроцедуры


&НаКлиенте
Процедура ВозвратИзПодряда(Команда)
	
	мКомплекты = Новый Массив;
	
	Для каждого х Из ТаблицаДанных Цикл
	
		Если х.Возврат Тогда
			мКомплекты.Добавить(Новый Структура("ИзделиеКомплект, НомерЧасти", х.ИзделиеКомплект, х.НомерЧасти));
		КонецЕсли;	
		
	КонецЦикла; 
	
	Если мКомплекты.Количество() > 0 Тогда
		ЗаписатьНаСервере(мКомплекты);
		ЗаполнитьТаблицуДанных();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЗаписатьНаСервере(мКомплекты)

	ТД = ТекущаяДата();
	
	СтруктураПараметров = омПодряд.СтруктураПараметровДляЗаписиЧастичногоПодряда();
	
	Для каждого ТекущийКомплект Из мКомплекты Цикл
	
		МенеджерЗаписи = РегистрыСведений.ЧастичныйПодряд.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИзделиеКомплект = ТекущийКомплект.ИзделиеКомплект;
		МенеджерЗаписи.НомерЧасти = ТекущийКомплект.НомерЧасти;
		МенеджерЗаписи.Период = ТД;
		МенеджерЗаписи.Завершен = Истина;
		
		МенеджерЗаписи.Записать();
	
	КонецЦикла;
	

КонецПроцедуры // ЗаписатьНаСервере(мКомплекты)
